Repository: amaurypm/transcode2H264
Catalog: locale/*/LC_MESSAGES/transcode2H264.po
Languages: es

source: usage
es: uso

source: positional arguments
es: argumentos posicionales

source: optional arguments
es: argumentos opcionales

source: the following arguments are required
es: se requieren los siguientes argumentos

source: unrecognized arguments
es: argumentos no conocidos

source: too few arguments
es: muy pocos argumentos

source: expected one argument
es: se requiere un argumento

source: Finding crop dimensions...
es: Buscando dimensiones para cortar...

source: WARNING: Deleting file {} as commanded with -r option. This file won't be easily recovered.
es: ADVERTENCIA: Borrado el fichero {} tal como se indicó con la opción -r. Este fichero no podrá ser recuperado con facilidad.

source: Removing temporary file '{}'.
es: Borrando el fichero temporal '{}'.

source: ==== Transcoding finished ====
es: ==== Transcodificación finalizada ====

source: == There following files were ignored: ==
es: == Fueron ignorados los siguientes ficheros: ==

source: == There were errors transcoding the files: ==
es: == Hubo errores con los siguientes ficheros: ==

source: ==== Final report ====
es: ==== Reporte final ====

source: file
es: fichero

source: files
es: ficheros

source: transcoded OK.
es: bien transcodificado(s).

source: with errors.
es: con errores.

source: ERROR: ffmpeg is not installed in your system. This script can not work properly without it.
es: ERROR: ffmpeg no está instalado en su sistema. Este script no funciona sin ffmpeg.

source: ERROR: mkvtoolnix is not installed in your system. This script can not work properly without it.
es: ERROR: mkvtoolnix no está instalado en su sistema. Este script no puede funcionar sin mkvtoolnix.

source: day
es: día

source: days
es: días

source: hour
es: hora

source: hours
es: horas

source: minute
es: minuto

source: minutes
es: minutos

source: second
es: segundo

source: seconds
es: segundos

source: This program transcode video files to H264 and AAC in MKV format. Subtitles, if present, are automatically detected and soft subbed into the corresponding output files.
es: Este programa transcodifica ficheros de video a H264 y AAC en un formato MKV. Los subtítulos, si hay, son detectados automáticamente e incluidos en los ficheros de salida correspondientes.

source: Input video file(s).
es: Fichero(s) de video de entrada.

source: Show this help message and exit.
es: Muestra este mensaje de ayuda y sale.

source: X264 preset [default: %(default)s].
es: X264 preset [valor por defecto: %(default)s].

source: CRF value [default: %(default)s]. Determines the output video quality. Smaller values gives better qualities and bigger file sizes, bigger values result in less quality and smaller file sizes. CRF values should be in the range of 0 to 51. 0 is lossless (and with the biggest file size), 51 is worst possible quality (with the smallest file size) and 18 is visually lossless. Default value results in a nice quality/size ratio.
es: Valor de CRF [valor por defecto: %(default)s]. Determina la calidad del video de salida. Con valores más pequeños se obtiene mayor calidad, pero con mayor tamaño de fichero, valores grandes resultan en menor calidad y menor tamaño de fichero. Los valores de CRF deben estar en el rango entre 0 y 51. 0 genera un video sin pérdida por compresión (lossless), pero con el mayor tamaño. 51 genera el video con peor calidad (y el menor tamaño) y 18 genera un video sin pérdida aparente de calidad. El valor por defecto genera videos con una buena relación calidad/tamaño.

source: If set then original video files will be erased after transcoding. WARNING: deleted files can not be easily recovered!
es: Si se especifica esta opción los videos originales van a ser borrados después de terminada la transcodificación. ALERTA: ¡Los videos borrados no pueden ser recuperados con facilidad!

source: Default audio language for MKV files obtained (used only if the original stream languages fail to be determined) [default: %(default)s].
es: Lenguaje por defecto de las pistas de audio en los ficheros MKV generados (utilizados solo en caso de que no puedan ser determinados de forma automática los lenguajes originales de estas pistas) [valor por defecto: %(default)s].

source: Default subtitle language of soft-subbed subtitles (only used if original subtitle languages fail to be determined) [default: %(default)s].
es: Lenguaje por defecto de los subtítulos incluidos en el o los ficheros de salida (utilizado solamente en el caso en que no se pueda determinar el lenguaje de los subtitulos) [valor por defecto: %(default)s].

source: Postfix to be added to newly created H.264 video files [default: %(default)s].
es: Prefijo que se le añade a los ficheros H.264 generados [default: %(default)s].

source: Indicates the number of processor cores the script will use. 0 indicates to use as many as possible [default: %(default)s].
es: Indica el número de núcleos de procesador que el script va a utilizar. El valor 0 implica utilizar tantos núcleos como sea posible [valor por defecto: %(default)s].

source: Turn on autocrop function. WARNING: Use with caution as some video files has variable width horizontal (and vertical) black bars, in those cases you will probably lose data.
es: Enciende la función de recorte automático. ALERTA: Use esta opción con cautela pues algunos videos poseen barras negras horizontales y/o verticales de ancho variable y en estos casos probablemente usted pierda información.

source: Show program's version number and exit.
es: Muestra la versión del programa y sale.

source: CRF values should be in the range of 0 to 51.
es: Los valores de CRF deben estar en el rango entre 0 to 51.

source: The number of threads must be 0 or positive.
es: El número de hilos debe ser 0 o positivo.

source: Unknown preset "{}". Valid values are: {}
es: preset desconocido "{}". Los valores válidos son: {}

source: ==== Transcoding file {:d}/{:d} ====
es: ==== Transcodificando el fichero {:d}/{:d} ====

source: File {} is not a proper video file.
es: El fichero {} no es un archivo de video.

source: Work finished in {}.
es: Trabajo finalizado en {}.

source: Exiting OK.
es: Finalizando OK.
